{
  "posts": [
    {
      "id": "why-i-left-medium",
      "title": "Why I Stopped Renting Space on Medium",
      "date": "February 5, 2026",
      "excerpt": "After years of publishing on Medium, I walked away. The paywall, the lack of ownership, the sameness. Here's why I stopped renting and started building.",
      "url": "posts/post.html?id=why-i-left-medium",
      "content": [
        "I published couple of posts on Medium. It was convenient. Write something, hit publish, and the platform handled the rest of the distribution, formatting, and readers. For a while, that trade-off felt worth it.",
        "But now it doesn't anymore.",
        "This isn't a takedown piece tbh, Medium served its purpose. But at some point the costs started outweighing the convenience, and I realized I was renting space on someone else's land when I could've been building my own house all along.",
        "═══ THE PAYWALL PROBLEM ═══",
        "Medium's monetization model fundamentally changed the relationship between writer and reader. The paywall doesn't protect quality, it gates access. When I write something, I want people to read it. Not to hit a wall asking for $5/month before they can see what I've written next.",
        "I don't write to earn fractions of a cent per clap. I write because sharing what I've learned shipping software for nearly a decade matters more to me than a payout dashboard. The paywall turned readers into conversion targets, and that's not a game I want to play.",
        "═══ RENTING VS OWNING ═══",
        "Every article I published on Medium lived on their domain, under their rules, rendered by their engine. I was a tenant. A tenant with no lease agreement and no guarantee that the landlord wouldn't change the locks.",
        "One algorithm change and your archive disappears from feeds. One policy update and your content gets different treatment. You're building someone else's library, not your own.",
        "After shipping more than 10,000 releases across different apps, I've learned that owning your pipeline matters. The same principle applies to writing. If the platform disappears tomorrow, where does your work go?",
        "═══ SIGNAL VS NOISE ═══",
        "Medium used to feel like a place where practitioners shared real experience. Somewhere along the way, it shifted. The feed filled up with listicles, engagement-bait headlines, and recycled advice dressed up as insight.",
        "The platform rewards volume and virality, not depth. When \"10 JavaScript Tricks You NEED to Know\" sits next to a thoughtful architecture post and gets 50x the engagement, the incentive structure is broken. Good content drowns in noise.",
        "═══ WHY A PERSONAL BLOG ═══",
        "This blog is the opposite of everything I just described.",
        "• No paywall, free, forever",
        "• No sign-up nags or cookie banners",
        "• Reflects my desk",
        "• My content, my domain, my rules, why not?",
        "It loads fast, it's simple, and it prioritizes the one thing that actually matters: the writing itself.",
        "Building your own blog in 2026 might seem old-fashioned. But so does shipping software that actually works. Sometimes the old ways are the right ways.",
        "If you're an engineer still publishing exclusively on Medium, consider this: you'd never ship an app where a third party controlled the deployment pipeline, the UI, and whether users could actually access your product. Why accept that for your writing?",
        "I'm trying to own my platform and not renting it."
      ]
    }
  ]
}
